In [2]:
import pandas
pandas.__version__

'1.1.5'

In [3]:
import pandas as pd
import numpy as np

In [ ]:
np.__version__

'1.19.2'

In [4]:
cnt = pd.Series([100,102,104,106,118])
cnt

0    100
1    102
2    104
3    106
4    118
dtype: int64

In [5]:
cnt.values

array([100, 102, 104, 106, 118])

In [6]:
cnt.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
import pandas as pd
b = pd.Series([100,102,104,106],
    index = ['rk','ak','ajay','ab'])
b

rk      100
ak      102
ajay    104
ab      106
dtype: int64

In [8]:
b['ajay']

104

In [ ]:
b.name = 'x'
b.index.name = 'id'
b

id
rk    100
ak    102
aj    104
ab    106
Name: x, dtype: int64

In [ ]:
b[0]

100

In [ ]:
np.log(b)

id
rk    4.605170
ak    4.624973
aj    4.644391
ab    4.663439
Name: x, dtype: float64

In [ ]:
b[b>110]

Series([], Name: x, dtype: int64)

In [ ]:
b[b>102]

id
aj    104
ab    106
Name: x, dtype: int64

In [9]:
b_dict = {'rk':10,'rj':12,'aj':14,'ab':16,'ab':18}
print(b_dict)

{'rk': 10, 'rj': 12, 'aj': 14, 'ab': 18}

In [ ]:
pd.Series(b_dict)

rk    10
rj    12
aj    14
ab    18
dtype: int64

In [10]:
d = {"Sname":["SACHIN","ABHINAV","AJAY","ABHISHEK"],
    "Year":[2017,2017,2017,2016],
    "Rate":[10,9,9,9]}

In [11]:
print(d)

{'Sname': ['SACHIN', 'ABHINAV', 'AJAY', 'ABHISHEK'], 'Year': [2017, 2017, 2017, 2016], 'Rate': [10, 9, 9, 9]}

In [12]:
d=pd.DataFrame(d)
d

      Sname  Year  Rate
0    SACHIN  2017    10
1   ABHINAV  2017     9
2      AJAY  2017     9
3  ABHISHEK  2016     9

In [13]:
df = pd.DataFrame(d,columns=["Year","Sname","Rate"])
print(df)

   Year     Sname  Rate
0  2017    SACHIN    10
1  2017   ABHINAV     9
2  2017      AJAY     9
3  2016  ABHISHEK     9

In [14]:
df['NewCol']=df.Year/df.Rate
df

   Year     Sname  Rate      NewCol
0  2017    SACHIN    10  201.700000
1  2017   ABHINAV     9  224.111111
2  2017      AJAY     9  224.111111
3  2016  ABHISHEK     9  224.000000

In [15]:
df['Serie_Aligned'] = pd.Series(range(4), index =[0,1,2,3,])
df

   Year     Sname  Rate      NewCol  Serie_Aligned
0  2017    SACHIN    10  201.700000              0
1  2017   ABHINAV     9  224.111111              1
2  2017      AJAY     9  224.111111              2
3  2016  ABHISHEK     9  224.000000              3

In [16]:
df.to_dict()

{'NewCol': {0: 201.7, 1: 224.11111111111111, 2: 224.11111111111111, 3: 224.0},
 'Rate': {0: 10, 1: 9, 2: 9, 3: 9},
 'Serie_Aligned': {0: 0, 1: 1, 2: 2, 3: 3},
 'Sname': {0: 'SACHIN', 1: 'ABHINAV', 2: 'AJAY', 3: 'ABHISHEK'},
 'Year': {0: 2017, 1: 2017, 2: 2017, 3: 2016}}

In [17]:
pd.DataFrame(df.to_dict())

   Year     Sname  Rate      NewCol  Serie_Aligned
0  2017    SACHIN    10  201.700000              0
1  2017   ABHINAV     9  224.111111              1
2  2017      AJAY     9  224.111111              2
3  2016  ABHISHEK     9  224.000000              3

In [18]:
data = [{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [19]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [20]:
x = [{'u':i*i,'b':100*i}for i in range(10)]
print(x)

[{'u': 0, 'b': 0}, {'u': 1, 'b': 100}, {'u': 4, 'b': 200}, {'u': 9, 'b': 300}, {'u': 16, 'b': 400}, {'u': 25, 'b': 500}, {'u': 36, 'b': 600}, {'u': 49, 'b': 700}, {'u': 64, 'b': 800}, {'u': 81, 'b': 900}]

In [21]:
pd.DataFrame(x)

    u    b
0   0    0
1   1  100
2   4  200
3   9  300
4  16  400
5  25  500
6  36  600
7  49  700
8  64  800
9  81  900

In [22]:
y = [{'u':1,'v':2},{'u':3,'w':4}]
pd.DataFrame(y)

   u    v    w
0  1  2.0  NaN
1  3  NaN  4.0

In [23]:
#NaN means Not a Number